codeflight1/fprime-stm32-reference/Core/Top/CoreTopology.cpp
// ======================================================================
// \title  CoreTopology.cpp
// \brief cpp file containing the topology instantiation code
//
// ======================================================================
// Provides access to autocoded functions
#include <Core/Top/CoreTopologyAc.hpp>
// Note: Uncomment when using Svc:TlmPacketizer
//#include <Core/Top/CorePacketsAc.hpp>

// Necessary project-specified types
#include <Fw/Types/MallocAllocator.hpp>
#include <Svc/FrameAccumulator/FrameDetector/FprimeFrameDetector.hpp>

#include <fprime-baremetal/Os/TaskRunner/TaskRunner.cpp>

// Used for 1Hz synthetic cycling
#include <Os/Mutex.hpp>
#include <Utils/Hash/HashConfig.hpp>

#include "stm32_hal.h"

// Allows easy reference to objects in FPP/autocoder required namespaces
using namespace Core;

// The reference topology uses a malloc-based allocator for components that need to allocate memory during the
// initialization phase.
Fw::MallocAllocator mallocator;

// FprimeFrameDetector is used to configure the FrameAccumulator to detect F Prime frames
Svc::FrameDetectors::FprimeFrameDetector frameDetector;

Svc::ComQueue::QueueConfigurationTable configurationTable;

// The reference topology divides the incoming clock signal (1Hz) into sub-signals: 1Hz, 1/2Hz, and 1/4Hz with 0 offset
Svc::RateGroupDriver::DividerSet rateGroupDivisorsSet{{{1, 0}, {2, 0}, {4, 0}}};

// Rate groups may supply a context token to each of the attached children whose purpose is set by the project. The
// reference topology sets each token to zero as these contexts are unused in this project.
// NATIVE_INT_TYPE rateGroup1Context[Svc::PassiveRateGroup::CONNECTION_COUNT_MAX] = {};
U32 rateGroup1Context[10] = {};
U32 rateGroup2Context[10] = {};
U32 rateGroup3Context[10] = {};

// A number of constants are needed for construction of the topology. These are specified here.
enum TopologyConstants {
    CMD_SEQ_BUFFER_SIZE = 5 * 1024,
    FILE_DOWNLINK_TIMEOUT = 1000,
    FILE_DOWNLINK_COOLDOWN = 1000,
    FILE_DOWNLINK_CYCLE_TIME = 1000,
    FILE_DOWNLINK_FILE_QUEUE_DEPTH = 10,
    HEALTH_WATCHDOG_CODE = 0x123,
    COMM_PRIORITY = 100,
    // bufferManager constants
    FRAMER_BUFFER_SIZE = FW_MAX(FW_COM_BUFFER_MAX_SIZE, FW_FILE_BUFFER_MAX_SIZE + sizeof(U32)) + HASH_DIGEST_LENGTH + Svc::FpFrameHeader::SIZE,
    FRAMER_BUFFER_COUNT = 30,
    DEFRAMER_BUFFER_SIZE = FW_MAX(FW_COM_BUFFER_MAX_SIZE, FW_FILE_BUFFER_MAX_SIZE + sizeof(U32)),
    DEFRAMER_BUFFER_COUNT = 30,
    COM_DRIVER_BUFFER_SIZE = 3000,
    COM_DRIVER_BUFFER_COUNT = 30,
    BUFFER_MANAGER_ID = 200
};

// Ping entries are autocoded, however; this code is not properly exported. Thus, it is copied here.
Svc::Health::PingEntry pingEntries[] = {
    {PingEntries::Core_blockDrv::WARN, PingEntries::Core_blockDrv::FATAL, "blockDrv"},
    {PingEntries::Core_tlmSend::WARN, PingEntries::Core_tlmSend::FATAL, "chanTlm"},
    {PingEntries::Core_cmdDisp::WARN, PingEntries::Core_cmdDisp::FATAL, "cmdDisp"},
    {PingEntries::Core_cmdSeq::WARN, PingEntries::Core_cmdSeq::FATAL, "cmdSeq"},
    {PingEntries::Core_eventLogger::WARN, PingEntries::Core_eventLogger::FATAL, "eventLogger"},
    {PingEntries::Core_fileDownlink::WARN, PingEntries::Core_fileDownlink::FATAL, "fileDownlink"},
    {PingEntries::Core_fileManager::WARN, PingEntries::Core_fileManager::FATAL, "fileManager"},
    {PingEntries::Core_fileUplink::WARN, PingEntries::Core_fileUplink::FATAL, "fileUplink"},
    {PingEntries::Core_prmDb::WARN, PingEntries::Core_prmDb::FATAL, "prmDb"},
    {PingEntries::Core_rateGroup1::WARN, PingEntries::Core_rateGroup1::FATAL, "rateGroup1"},
    {PingEntries::Core_rateGroup2::WARN, PingEntries::Core_rateGroup2::FATAL, "rateGroup2"},
    {PingEntries::Core_rateGroup3::WARN, PingEntries::Core_rateGroup3::FATAL, "rateGroup3"},
};

/**
 * \brief configure/setup components in project-specific way
 *
 * This is a *helper* function which configures/sets up each component requiring project specific input. This includes
 * allocating resources, passing-in arguments, etc. This function may be inlined into the topology setup function if
 * desired, but is extracted here for clarity.
 */
void configureTopology() {
    // Buffer managers need a configured set of buckets and an allocator used to allocate memory for those buckets.
    Svc::BufferManager::BufferBins upBuffMgrBins;
    memset(&upBuffMgrBins, 0, sizeof(upBuffMgrBins));
    upBuffMgrBins.bins[0].bufferSize = FRAMER_BUFFER_SIZE;
    upBuffMgrBins.bins[0].numBuffers = FRAMER_BUFFER_COUNT;
    upBuffMgrBins.bins[1].bufferSize = DEFRAMER_BUFFER_SIZE;
    upBuffMgrBins.bins[1].numBuffers = DEFRAMER_BUFFER_COUNT;
    upBuffMgrBins.bins[2].bufferSize = COM_DRIVER_BUFFER_SIZE;
    upBuffMgrBins.bins[2].numBuffers = COM_DRIVER_BUFFER_COUNT;
    bufferManager.setup(BUFFER_MANAGER_ID, 0, mallocator, upBuffMgrBins);

    // FprimeFrameDetector is used to configure the FrameAccumulator to detect F Prime frames
    frameAccumulator.configure(frameDetector, 1, mallocator, 2048); 

    // Command sequencer needs to allocate memory to hold contents of command sequences
    // cmdSeq.allocateBuffer(0, mallocator, CMD_SEQ_BUFFER_SIZE);

    // Rate group driver needs a divisor list
    rateGroupDriver.configure(rateGroupDivisorsSet);

    // Rate groups require context arrays.
    rateGroup1.configure(rateGroup1Context, FW_NUM_ARRAY_ELEMENTS(rateGroup1Context));
    rateGroup2.configure(rateGroup2Context, FW_NUM_ARRAY_ELEMENTS(rateGroup2Context));
    rateGroup3.configure(rateGroup3Context, FW_NUM_ARRAY_ELEMENTS(rateGroup3Context));

    // File downlink requires some project-derived properties.
    // fileDownlink.configure(FILE_DOWNLINK_TIMEOUT, FILE_DOWNLINK_COOLDOWN, FILE_DOWNLINK_CYCLE_TIME,
                           // FILE_DOWNLINK_FILE_QUEUE_DEPTH);

    // Parameter database is configured with a database file name, and that file must be initially read.
    // prmDb.configure("PrmDb.dat");
    // prmDb.readParamFile();

    // Health is supplied a set of ping entires.
    health.setPingEntries(pingEntries, FW_NUM_ARRAY_ELEMENTS(pingEntries), HEALTH_WATCHDOG_CODE);

    // Note: Uncomment when using Svc:TlmPacketizer
    // tlmSend.setPacketList(CorePacketsPkts, CorePacketsIgnore, 1);

    // Events (highest-priority)
    configurationTable.entries[0] = {.depth = 100, .priority = 0};
    // Telemetry
    configurationTable.entries[1] = {.depth = 500, .priority = 2};
    // File Downlink
    // configurationTable.entries[2] = {.depth = 100, .priority = 1};
    // Allocation identifier is 0 as the MallocAllocator discards it
    comQueue.configure(configurationTable, 0, mallocator);
}

// Public functions for use in main program are namespaced with deployment name Core
namespace Core {
void setupTopology(const TopologyState& state) {
    // Autocoded initialization. Function provided by autocoder.
    initComponents(state);
    // Autocoded id setup. Function provided by autocoder.
    setBaseIds();
    // Autocoded connection wiring. Function provided by autocoder.
    connectComponents();
    // Autocoded configuration. Function provided by autocoder.
    configComponents(state);
    // Deployment-specific component configuration. Function provided above. May be inlined, if desired.
    configureTopology();
    // Autocoded command registration. Function provided by autocoder.
    regCommands();
    // Autocoded parameter loading. Function provided by autocoder.
    loadParameters();
    // Autocoded task kick-off (active components). Function provided by autocoder.
    startTasks(state);
    // if (state.uartDevice != nullptr) {
    //     Os::TaskString name("ReceiveTask");
    //     // Uplink is configured for receive so a socket task is started
    //     if (comDriver.open(state.uartDevice, static_cast<Drv::LinuxUartDriver::UartBaudRate>(state.baudRate), 
    //                        Drv::LinuxUartDriver::NO_FLOW, Drv::LinuxUartDriver::PARITY_NONE, Svc::DeframerCfg::RING_BUFFER_SIZE)) {
    //         comDriver.start(COMM_PRIORITY, Default::STACK_SIZE);
    //     } else {
    //         printf("Failed to open UART device %s at baud rate %" PRIu32 "\n", state.uartDevice, state.baudRate);
    //     }
    // }
}

void startSimulatedCycle(Fw::TimeInterval interval) {
    // Main loop
    while (true) {
        // Core::blockDrv.callIsr();
        // Os::Task::delay(interval);
        HAL_Delay(interval.getSeconds() * 1000 + interval.getUSeconds() / 1000);
        Os::Baremetal::TaskRunner::getSingleton().run();
    }
}

void teardownTopology(const TopologyState& state) {
    // Autocoded (active component) task clean-up. Functions provided by topology autocoder.
    stopTasks(state);
    freeThreads(state);

    // Other task clean-up.
    // comDriver.quitReadThread();
    // (void)comDriver.join();

    // Resource deallocation
    // cmdSeq.deallocateBuffer(mallocator);
    bufferManager.cleanup();
}
};  // namespace Core
